#pragma once

// Name: ArkUWP, Version: 1.0.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum ShooterGame.EMissionState
enum class ShooterGame_EMissionState : uint8_t
{
	EMissionState__ServerSetup     = 0,
	EMissionState__Activated       = 1,
	EMissionState__Suspended       = 2,
	EMissionState__Deactivated     = 3,
	EMissionState__EMissionState_MAX = 4,

};

// Enum ShooterGame.EMissionTimerMode
enum class ShooterGame_EMissionTimerMode : uint8_t
{
	EMissionTimerMode__HideTimer   = 0,
	EMissionTimerMode__ShowTimeRemaining = 1,
	EMissionTimerMode__ShowTimeElapsed = 2,
	EMissionTimerMode__UseBPGetMissionTimerText = 3,
	EMissionTimerMode__EMissionTimerMode_MAX = 4,

};

// Enum ShooterGame.ESpawnPattern
enum class ShooterGame_ESpawnPattern : uint8_t
{
	ESpawnPattern__Circle          = 0,
	ESpawnPattern__Grid            = 1,
	ESpawnPattern__Random          = 2,
	ESpawnPattern__ESpawnPattern_MAX = 3,

};

// Enum ShooterGame.EMissionRelatedPropertyUsage
enum class ShooterGame_EMissionRelatedPropertyUsage : uint8_t
{
	EMissionRelatedPropertyUsage__Prefix = 0,
	EMissionRelatedPropertyUsage__Suffix = 1,
	EMissionRelatedPropertyUsage__Description = 2,
	EMissionRelatedPropertyUsage__EMissionRelatedPropertyUsage_MAX = 3,

};

// Enum ShooterGame.EMissionRelatedPropertyType
enum class ShooterGame_EMissionRelatedPropertyType : uint8_t
{
	EMissionRelatedPropertyType__Name_PropertyType = 0,
	EMissionRelatedPropertyType__String_PropertyType = 1,
	EMissionRelatedPropertyType__Boolean_PropertyType = 2,
	EMissionRelatedPropertyType__Integer_PropertyType = 3,
	EMissionRelatedPropertyType__Float_PropertyType = 4,
	EMissionRelatedPropertyType__Double_PropertyType = 5,
	EMissionRelatedPropertyType__EMissionRelatedPropertyType_MAX = 6,

};

// Enum ShooterGame.ESTOFNotificationType
enum class ShooterGame_ESTOFNotificationType : uint8_t
{
	ESTOFNotificationType__Death   = 0,
	ESTOFNotificationType__TribeEliminated = 1,
	ESTOFNotificationType__MatchVictory = 2,
	ESTOFNotificationType__MatchDraw = 3,
	ESTOFNotificationType__MAX     = 4,
	ESTOFNotificationType__ESTOFNotificationType_MAX = 5,

};

// Enum ShooterGame.EPrimalARKTributeDataType
enum class ShooterGame_EPrimalARKTributeDataType : uint8_t
{
	EPrimalARKTributeDataType__Items = 0,
	EPrimalARKTributeDataType__TamedDinos = 1,
	EPrimalARKTributeDataType__CharacterData = 2,
	EPrimalARKTributeDataType__MAX = 3,
	EPrimalARKTributeDataType__EPrimalARKTributeDataType_MAX = 4,

};

// Enum ShooterGame.EPrimalCharacterStatusValue
enum class ShooterGame_EPrimalCharacterStatusValue : uint8_t
{
	EPrimalCharacterStatusValue__Health = 0,
	EPrimalCharacterStatusValue__Stamina = 1,
	EPrimalCharacterStatusValue__Torpidity = 2,
	EPrimalCharacterStatusValue__Oxygen = 3,
	EPrimalCharacterStatusValue__Food = 4,
	EPrimalCharacterStatusValue__Water = 5,
	EPrimalCharacterStatusValue__Temperature = 6,
	EPrimalCharacterStatusValue__Weight = 7,
	EPrimalCharacterStatusValue__MeleeDamageMultiplier = 8,
	EPrimalCharacterStatusValue__SpeedMultiplier = 9,
	EPrimalCharacterStatusValue__TemperatureFortitude = 10,
	EPrimalCharacterStatusValue__CraftingSpeedMultiplier = 11,
	EPrimalCharacterStatusValue__MAX = 12,
	EPrimalCharacterStatusValue__EPrimalCharacterStatusValue_MAX = 13,

};

// Enum ShooterGame.EBoolExecResult
enum class ShooterGame_EBoolExecResult : uint8_t
{
	EBoolExecResult__Success       = 0,
	EBoolExecResult__Failed        = 1,
	EBoolExecResult__EBoolExecResult_MAX = 2,

};

// Enum ShooterGame.ECameraStyle
enum class ShooterGame_ECameraStyle : uint8_t
{
	ECameraStyle__Default          = 0,
	ECameraStyle__FirstPerson      = 1,
	ECameraStyle__ThirdPerson      = 2,
	ECameraStyle__FreeCam          = 3,
	ECameraStyle__Orbit            = 4,
	ECameraStyle__Spectator        = 5,
	ECameraStyle__ECameraStyle_MAX = 6,

};

// Enum ShooterGame.ETargetingTeamBehavior
enum class ShooterGame_ETargetingTeamBehavior : uint8_t
{
	ETargetingTeamBehavior__ExactMatch = 0,
	ETargetingTeamBehavior__FriendlyWith = 1,
	ETargetingTeamBehavior__PrioritizeButIncludeAny = 2,
	ETargetingTeamBehavior__ETargetingTeamBehavior_MAX = 3,

};

// Enum ShooterGame.EChatMessageType
enum class ShooterGame_EChatMessageType : uint8_t
{
	EChatMessageType__MyMessage    = 0,
	EChatMessageType__SameTeamMessage = 1,
	EChatMessageType__DifferentTeamMessage = 2,
	EChatMessageType__SystemWideMessage = 3,
	EChatMessageType__SameAllianceMessage = 4,
	EChatMessageType__MAX          = 5,
	EChatMessageType__EChatMessageType_MAX = 6,

};

// Enum ShooterGame.EChatType
enum class ShooterGame_EChatType : uint8_t
{
	EChatType__GlobalChat          = 0,
	EChatType__ProximityChat       = 1,
	EChatType__RadioChat           = 2,
	EChatType__GlobalTribeChat     = 3,
	EChatType__AllianceChat        = 4,
	EChatType__MAX                 = 5,
	EChatType__EChatType_MAX       = 6,

};

// Enum ShooterGame.EChatSendMode
enum class ShooterGame_EChatSendMode : uint8_t
{
	EChatSendMode__GlobalChat      = 0,
	EChatSendMode__GlobalTribeChat = 1,
	EChatSendMode__LocalChat       = 2,
	EChatSendMode__AllianceChat    = 3,
	EChatSendMode__MAX             = 4,
	EChatSendMode__EChatSendMode_MAX = 5,

};

// Enum ShooterGame.EShooterPhysMaterialType
enum class ShooterGame_EShooterPhysMaterialType : uint8_t
{
	EShooterPhysMaterialType__Unknown = 0,
	EShooterPhysMaterialType__Concrete = 1,
	EShooterPhysMaterialType__Dirt = 2,
	EShooterPhysMaterialType__Water = 3,
	EShooterPhysMaterialType__Metal = 4,
	EShooterPhysMaterialType__Wood = 5,
	EShooterPhysMaterialType__Grass = 6,
	EShooterPhysMaterialType__Glass = 7,
	EShooterPhysMaterialType__Flesh = 8,
	EShooterPhysMaterialType__Leaves = 9,
	EShooterPhysMaterialType__Rock = 10,
	EShooterPhysMaterialType__Sand = 11,
	EShooterPhysMaterialType__Snow = 12,
	EShooterPhysMaterialType__Corruption = 13,
	EShooterPhysMaterialType__Lava = 14,
	EShooterPhysMaterialType__Acid = 15,
	EShooterPhysMaterialType__MAX  = 16,
	EShooterPhysMaterialType__EShooterPhysMaterialType_MAX = 17,

};

// Enum ShooterGame.EPlayerActionIndex
enum class ShooterGame_EPlayerActionIndex : uint8_t
{
	EPlayerActionIndex__None       = 0,
	EPlayerActionIndex__WhistleFollow = 1,
	EPlayerActionIndex__WhistleFollowOne = 2,
	EPlayerActionIndex__WhistleStop = 3,
	EPlayerActionIndex__WhistleStopOne = 4,
	EPlayerActionIndex__WhistleAggressive = 5,
	EPlayerActionIndex__WhistleNeutral = 6,
	EPlayerActionIndex__WhistlePassive = 7,
	EPlayerActionIndex__WhistleAttackTarget = 8,
	EPlayerActionIndex__WhistleLandFlyerOne = 9,
	EPlayerActionIndex__ShowInventory = 10,
	EPlayerActionIndex__ShowCraftables = 11,
	EPlayerActionIndex__ShowTribeManager = 12,
	EPlayerActionIndex__Poop       = 13,
	EPlayerActionIndex__UnHideCompanion = 14,
	EPlayerActionIndex__ShowEmoteSelection = 15,
	EPlayerActionIndex__Emote_HatSwitch = 16,
	EPlayerActionIndex__Emote_Salute = 17,
	EPlayerActionIndex__Emote_Sorry = 18,
	EPlayerActionIndex__Emote_Thank = 19,
	EPlayerActionIndex__Emote_Wave = 20,
	EPlayerActionIndex__Emote_Laugh = 21,
	EPlayerActionIndex__Emote_Yes  = 22,
	EPlayerActionIndex__Emote_No   = 23,
	EPlayerActionIndex__Emote_Taunt = 24,
	EPlayerActionIndex__Emote_Cheer = 25,
	EPlayerActionIndex__Emote_FriendlyLowerHands = 26,
	EPlayerActionIndex__Emote_MAX  = 27,
	EPlayerActionIndex__EPlayerActionIndex_MAX = 28,

};

// Enum ShooterGame.EMissionAlertType
enum class ShooterGame_EMissionAlertType : uint8_t
{
	EMissionAlertType__Positive    = 0,
	EMissionAlertType__Neutral     = 1,
	EMissionAlertType__Negative    = 2,
	EMissionAlertType__EMissionAlertType_MAX = 3,

};

// Enum ShooterGame.EPhaseRequirementWidgetVisualState
enum class ShooterGame_EPhaseRequirementWidgetVisualState : uint8_t
{
	EPhaseRequirementWidgetVisualState__Neutral = 0,
	EPhaseRequirementWidgetVisualState__Positive = 1,
	EPhaseRequirementWidgetVisualState__Negative = 2,
	EPhaseRequirementWidgetVisualState__Custom = 3,
	EPhaseRequirementWidgetVisualState__EPhaseRequirementWidgetVisualState_MAX = 4,

};

// Enum ShooterGame.ELootItemType
enum class ShooterGame_ELootItemType : uint8_t
{
	ELootItemType__None            = 0,
	ELootItemType__Element         = 1,
	ELootItemType__Hexagons        = 2,
	ELootItemType__ResourceCommon  = 3,
	ELootItemType__ResourceUncommon = 4,
	ELootItemType__ResourceRare    = 5,
	ELootItemType__ArmorTier1      = 6,
	ELootItemType__ArmorTier2      = 7,
	ELootItemType__ArmorTier3      = 8,
	ELootItemType__ArmorTek        = 9,
	ELootItemType__WeaponTier1     = 10,
	ELootItemType__WeaponTier2     = 11,
	ELootItemType__WeaponTier3     = 12,
	ELootItemType__WeaponTek       = 13,
	ELootItemType__AmmoTier1       = 14,
	ELootItemType__AmmoTier2       = 15,
	ELootItemType__AmmoTier3       = 16,
	ELootItemType__Saddle          = 17,
	ELootItemType__ELootItemType_MAX = 18,

};

// Enum ShooterGame.ESimpleCurve
enum class ShooterGame_ESimpleCurve : uint8_t
{
	ESimpleCurve__Linear           = 0,
	ESimpleCurve__Pow0             = 1,
	ESimpleCurve__Pow1             = 2,
	ESimpleCurve__Pow101           = 3,
	ESimpleCurve__Pow2             = 4,
	ESimpleCurve__Pow201           = 5,
	ESimpleCurve__Pow3             = 6,
	ESimpleCurve__Pow301           = 7,
	ESimpleCurve__PowCos0          = 8,
	ESimpleCurve__PowCos1          = 9,
	ESimpleCurve__PowCos101        = 10,
	ESimpleCurve__PowCos2          = 11,
	ESimpleCurve__PowCos201        = 12,
	ESimpleCurve__PowCos3          = 13,
	ESimpleCurve__PowCos301        = 14,
	ESimpleCurve__PowSin0          = 15,
	ESimpleCurve__PowSin1          = 16,
	ESimpleCurve__PowSin101        = 17,
	ESimpleCurve__PowSin2          = 18,
	ESimpleCurve__PowSin201        = 19,
	ESimpleCurve__PowSin3          = 20,
	ESimpleCurve__PowSin301        = 21,
	ESimpleCurve__PowMinCos0       = 22,
	ESimpleCurve__PowMinCos1       = 23,
	ESimpleCurve__PowMinCos101     = 24,
	ESimpleCurve__PowMinCos2       = 25,
	ESimpleCurve__PowMinCos201     = 26,
	ESimpleCurve__PowMinCos3       = 27,
	ESimpleCurve__PowMinCos301     = 28,
	ESimpleCurve__PowMax0          = 29,
	ESimpleCurve__PowMax1          = 30,
	ESimpleCurve__PowMax101        = 31,
	ESimpleCurve__PowMax2          = 32,
	ESimpleCurve__PowMax201        = 33,
	ESimpleCurve__PowMax3          = 34,
	ESimpleCurve__PowMax301        = 35,
	ESimpleCurve__ESimpleCurve_MAX = 36,

};

// Enum ShooterGame.EHUDElementType
enum class ShooterGame_EHUDElementType : uint8_t
{
	EHUDElementType__Text          = 0,
	EHUDElementType__ProgressBar   = 1,
	EHUDElementType__Image         = 2,
	EHUDElementType__EHUDElementType_MAX = 3,

};

// Enum ShooterGame.EHUDElementAnchorMode
enum class ShooterGame_EHUDElementAnchorMode : uint8_t
{
	EHUDElementAnchorMode__Specified = 0,
	EHUDElementAnchorMode__QuickbarLeft = 1,
	EHUDElementAnchorMode__QuickbarRight = 2,
	EHUDElementAnchorMode__QuickbarTop = 3,
	EHUDElementAnchorMode__EHUDElementAnchorMode_MAX = 4,

};

// Enum ShooterGame.EStencilAlliance
enum class ShooterGame_EStencilAlliance : uint8_t
{
	EStencilAlliance__None         = 0,
	EStencilAlliance__Friendly     = 1,
	EStencilAlliance__NPC          = 2,
	EStencilAlliance__NPCFleeing   = 3,
	EStencilAlliance__Hostile      = 4,
	EStencilAlliance__Ally         = 5,
	EStencilAlliance__Element      = 6,
	EStencilAlliance__EStencilAlliance_MAX = 7,

};

// Enum ShooterGame.EHUDElementHorizontalAlignment
enum class ShooterGame_EHUDElementHorizontalAlignment : uint8_t
{
	EHUDElementHorizontalAlignment__Center = 0,
	EHUDElementHorizontalAlignment__Left = 1,
	EHUDElementHorizontalAlignment__Right = 2,
	EHUDElementHorizontalAlignment__EHUDElementHorizontalAlignment_MAX = 3,

};

// Enum ShooterGame.EHUDElementVerticalAlignment
enum class ShooterGame_EHUDElementVerticalAlignment : uint8_t
{
	EHUDElementVerticalAlignment__Center = 0,
	EHUDElementVerticalAlignment__Top = 1,
	EHUDElementVerticalAlignment__Bottom = 2,
	EHUDElementVerticalAlignment__EHUDElementVerticalAlignment_MAX = 3,

};

// Enum ShooterGame.ELeaderboardColumnName
enum class ShooterGame_ELeaderboardColumnName : uint8_t
{
	ELeaderboardColumnName__MissionTag = 0,
	ELeaderboardColumnName__PlayerNetId = 1,
	ELeaderboardColumnName__TribeId = 2,
	ELeaderboardColumnName__TimestampUtc = 3,
	ELeaderboardColumnName__FloatValue = 4,
	ELeaderboardColumnName__IntValue = 5,
	ELeaderboardColumnName__NameValue = 6,
	ELeaderboardColumnName__StringValue = 7,
	ELeaderboardColumnName__ELeaderboardColumnName_MAX = 8,

};

// Enum ShooterGame.ELeaderboardGroupByMode
enum class ShooterGame_ELeaderboardGroupByMode : uint8_t
{
	ELeaderboardGroupByMode__None  = 0,
	ELeaderboardGroupByMode__First = 1,
	ELeaderboardGroupByMode__Min   = 2,
	ELeaderboardGroupByMode__Max   = 3,
	ELeaderboardGroupByMode__Sum   = 4,
	ELeaderboardGroupByMode__Count = 5,
	ELeaderboardGroupByMode__Average = 6,
	ELeaderboardGroupByMode__ELeaderboardGroupByMode_MAX = 7,

};

// Enum ShooterGame.ELeaderboardOrdering
enum class ShooterGame_ELeaderboardOrdering : uint8_t
{
	ELeaderboardOrdering__Ascending = 0,
	ELeaderboardOrdering__Descending = 1,
	ELeaderboardOrdering__ELeaderboardOrdering_MAX = 2,

};

// Enum ShooterGame.EMassTeleportState
enum class ShooterGame_EMassTeleportState : uint8_t
{
	EMassTeleportState__INITIATED  = 0,
	EMassTeleportState__TRIGGERED_SUCCESS = 1,
	EMassTeleportState__TRIGGERED_FAILED = 2,
	EMassTeleportState__COMPLETED  = 3,
	EMassTeleportState__CANCELLED  = 4,
	EMassTeleportState__EMassTeleportState_MAX = 5,

};

// Enum ShooterGame.PrimalGameData.EPrimalCharacterStatusState
enum class ShooterGame_EPrimalCharacterStatusState : uint8_t
{
	EPrimalCharacterStatusState__Dead = 0,
	EPrimalCharacterStatusState__Winded = 1,
	EPrimalCharacterStatusState__Starvation = 2,
	EPrimalCharacterStatusState__Dehydration = 3,
	EPrimalCharacterStatusState__Suffocation = 4,
	EPrimalCharacterStatusState__Encumbered = 5,
	EPrimalCharacterStatusState__Hypothermia = 6,
	EPrimalCharacterStatusState__Hyperthermia = 7,
	EPrimalCharacterStatusState__Injured = 8,
	EPrimalCharacterStatusState__KnockedOut = 9,
	EPrimalCharacterStatusState__Sleeping = 10,
	EPrimalCharacterStatusState__Cold = 11,
	EPrimalCharacterStatusState__Hot = 12,
	EPrimalCharacterStatusState__Crafting = 13,
	EPrimalCharacterStatusState__MAX = 14,
	EPrimalCharacterStatusState__EPrimalCharacterStatusState_MAX = 15,

};

// Enum ShooterGame.PrimalGameData.EPrimalConsumableType
enum class ShooterGame_EPrimalConsumableType : uint8_t
{
	EPrimalConsumableType__Food    = 0,
	EPrimalConsumableType__Water   = 1,
	EPrimalConsumableType__Medicine = 2,
	EPrimalConsumableType__Other   = 3,
	EPrimalConsumableType__MAX     = 4,
	EPrimalConsumableType__EPrimalConsumableType_MAX = 5,

};

// Enum ShooterGame.PrimalGameData.ELevelExperienceRampType
enum class ShooterGame_ELevelExperienceRampType : uint8_t
{
	ELevelExperienceRampType__Player = 0,
	ELevelExperienceRampType__DinoEasy = 1,
	ELevelExperienceRampType__DinoMedium = 2,
	ELevelExperienceRampType__DinoHard = 3,
	ELevelExperienceRampType__MAX  = 4,
	ELevelExperienceRampType__ELevelExperienceRampType_MAX = 5,

};

// Enum ShooterGame.PrimalGameData.EPrimalItemType
enum class ShooterGame_EPrimalItemType : uint8_t
{
	EPrimalItemType__MiscConsumable = 0,
	EPrimalItemType__Equipment     = 1,
	EPrimalItemType__Weapon        = 2,
	EPrimalItemType__Ammo          = 3,
	EPrimalItemType__Structure     = 4,
	EPrimalItemType__Resource      = 5,
	EPrimalItemType__Skin          = 6,
	EPrimalItemType__WeaponAttachment = 7,
	EPrimalItemType__Artifact      = 8,
	EPrimalItemType__MAX           = 9,
	EPrimalItemType__EPrimalItemType_MAX = 10,

};

// Enum ShooterGame.PrimalGameData.EPrimalCharacterInputType
enum class ShooterGame_EPrimalCharacterInputType : uint8_t
{
	EPrimalCharacterInputType__PrimaryFire = 0,
	EPrimalCharacterInputType__Targeting = 1,
	EPrimalCharacterInputType__AltFire = 2,
	EPrimalCharacterInputType__SwitchWeapon = 3,
	EPrimalCharacterInputType__Reload = 4,
	EPrimalCharacterInputType__Crouch = 5,
	EPrimalCharacterInputType__Prone = 6,
	EPrimalCharacterInputType__CrouchProneToggle = 7,
	EPrimalCharacterInputType__SwitchMap = 8,
	EPrimalCharacterInputType__DinoAttack = 9,
	EPrimalCharacterInputType__EPrimalCharacterInputType_MAX = 10,

};

// Enum ShooterGame.PrimalGameData.EPrimalItemStat
enum class ShooterGame_EPrimalItemStat : uint8_t
{
	EPrimalItemStat__GenericQuality = 0,
	EPrimalItemStat__Armor         = 1,
	EPrimalItemStat__MaxDurability = 2,
	EPrimalItemStat__WeaponDamagePercent = 3,
	EPrimalItemStat__WeaponClipAmmo = 4,
	EPrimalItemStat__HypothermalInsulation = 5,
	EPrimalItemStat__Weight        = 6,
	EPrimalItemStat__HyperthermalInsulation = 7,
	EPrimalItemStat__MAX           = 8,
	EPrimalItemStat__EPrimalItemStat_MAX = 9,

};

// Enum ShooterGame.PrimalGameData.EDinoTamedOrder
enum class ShooterGame_EDinoTamedOrder : uint8_t
{
	EDinoTamedOrder__SetAggressionPassive = 0,
	EDinoTamedOrder__SetAggressionNeutral = 1,
	EDinoTamedOrder__SetAggressionAggressive = 2,
	EDinoTamedOrder__SetAggressionAttackTarget = 3,
	EDinoTamedOrder__ToggleFollowMe = 4,
	EDinoTamedOrder__FollowMe      = 5,
	EDinoTamedOrder__StopFollowing = 6,
	EDinoTamedOrder__CycleFollowDistance = 7,
	EDinoTamedOrder__SetAggressionPassiveFlee = 8,
	EDinoTamedOrder__LandingToMe   = 9,
	EDinoTamedOrder__MAX           = 10,
	EDinoTamedOrder__EDinoTamedOrder_MAX = 11,

};

// Enum ShooterGame.PrimalGameData.EXPType
enum class ShooterGame_EXPType : uint8_t
{
	EXPType__XP_GENERIC            = 0,
	EXPType__XP_KILL               = 1,
	EXPType__XP_HARVEST            = 2,
	EXPType__XP_CRAFT              = 3,
	EXPType__XP_SPECIAL            = 4,
	EXPType__XP_ALPHAKILL          = 5,
	EXPType__MAX                   = 6,
	EXPType__EXPType_MAX           = 7,

};

// Enum ShooterGame.PrimalGameData.ETribeGroupPermission
enum class ShooterGame_ETribeGroupPermission : uint8_t
{
	ETribeGroupPermission__STRUCTUREACTIVATE = 0,
	ETribeGroupPermission__INVENTORYACCESS = 1,
	ETribeGroupPermission__PET_ORDER = 2,
	ETribeGroupPermission__PET_RIDE = 3,
	ETribeGroupPermission__GENERAL_STRUCTUREDEMOLISH = 4,
	ETribeGroupPermission__GENERAL_STRUCTUREATTACHMENT = 5,
	ETribeGroupPermission__GENERAL_BUILDSTRUCTUREINRANGE = 6,
	ETribeGroupPermission__INVITEMEMBER = 7,
	ETribeGroupPermission__PROMOTEMEMBER = 8,
	ETribeGroupPermission__DEMOTEMEMBER = 9,
	ETribeGroupPermission__BANISHMEMBER = 10,
	ETribeGroupPermission__PET_UNCLAIM = 11,
	ETribeGroupPermission__TELEPORT_MEMBERS = 12,
	ETribeGroupPermission__TELEPORT_DINOS = 13,
	ETribeGroupPermission__ETribeGroupPermission_MAX = 14,

};

// Enum ShooterGame.PrimalGameData.EBoneModifierType
enum class ShooterGame_EBoneModifierType : uint8_t
{
	EBoneModifierType__HEAD        = 0,
	EBoneModifierType__NECK        = 1,
	EBoneModifierType__NECKLENGTH  = 2,
	EBoneModifierType__CHEST       = 3,
	EBoneModifierType__SHOULDERS   = 4,
	EBoneModifierType__ARMLENGTH   = 5,
	EBoneModifierType__UPPERARM    = 6,
	EBoneModifierType__LOWERARM    = 7,
	EBoneModifierType__HAND        = 8,
	EBoneModifierType__LEGLENGTH   = 9,
	EBoneModifierType__UPPERLEG    = 10,
	EBoneModifierType__LOWERLEG    = 11,
	EBoneModifierType__FOOT        = 12,
	EBoneModifierType__HIP         = 13,
	EBoneModifierType__TORSO       = 14,
	EBoneModifierType__UPPERFACESIZE = 15,
	EBoneModifierType__LOWERFACESIZE = 16,
	EBoneModifierType__TORSODEPTH  = 17,
	EBoneModifierType__HEADHEIGHT  = 18,
	EBoneModifierType__HEADWIDTH   = 19,
	EBoneModifierType__HEADDEPTH   = 20,
	EBoneModifierType__TORSOHEIGHT = 21,
	EBoneModifierType__MAX         = 22,
	EBoneModifierType__EBoneModifierType_MAX = 23,

};

// Enum ShooterGame.PrimalGameData.EEngramGroup
enum class ShooterGame_EEngramGroup : uint8_t
{
	EEngramGroup__UnusedSpacer     = 0,
	EEngramGroup__UnusedSpacer01   = 1,
	EEngramGroup__ARK_PRIME        = 2,
	EEngramGroup__UnusedSpacer02   = 3,
	EEngramGroup__ARK_SCORCHEDEARTH = 4,
	EEngramGroup__UnusedSpacer03   = 5,
	EEngramGroup__UnusedSpacer04   = 6,
	EEngramGroup__UnusedSpacer05   = 7,
	EEngramGroup__ARK_TEK          = 8,
	EEngramGroup__UnusedSpacer06   = 9,
	EEngramGroup__UnusedSpacer07   = 10,
	EEngramGroup__UnusedSpacer08   = 11,
	EEngramGroup__UnusedSpacer09   = 12,
	EEngramGroup__UnusedSpacer10   = 13,
	EEngramGroup__UnusedSpacer11   = 14,
	EEngramGroup__UnusedSpacer12   = 15,
	EEngramGroup__ARK_UNLEARNED    = 16,
	EEngramGroup__UnusedSpacer13   = 17,
	EEngramGroup__UnusedSpacer14   = 18,
	EEngramGroup__UnusedSpacer15   = 19,
	EEngramGroup__UnusedSpacer16   = 20,
	EEngramGroup__UnusedSpacer17   = 21,
	EEngramGroup__UnusedSpacer18   = 22,
	EEngramGroup__UnusedSpacer19   = 23,
	EEngramGroup__UnusedSpacer20   = 24,
	EEngramGroup__UnusedSpacer21   = 25,
	EEngramGroup__UnusedSpacer22   = 26,
	EEngramGroup__UnusedSpacer23   = 27,
	EEngramGroup__UnusedSpacer24   = 28,
	EEngramGroup__UnusedSpacer25   = 29,
	EEngramGroup__UnusedSpacer26   = 30,
	EEngramGroup__UnusedSpacer27   = 31,
	EEngramGroup__ARK_ABERRATION   = 32,
	EEngramGroup__UnusedSpacer28   = 33,
	EEngramGroup__UnusedSpacer29   = 34,
	EEngramGroup__UnusedSpacer30   = 35,
	EEngramGroup__UnusedSpacer31   = 36,
	EEngramGroup__UnusedSpacer32   = 37,
	EEngramGroup__UnusedSpacer33   = 38,
	EEngramGroup__UnusedSpacer34   = 39,
	EEngramGroup__UnusedSpacer35   = 40,
	EEngramGroup__UnusedSpacer36   = 41,
	EEngramGroup__UnusedSpacer37   = 42,
	EEngramGroup__UnusedSpacer38   = 43,
	EEngramGroup__UnusedSpacer39   = 44,
	EEngramGroup__UnusedSpacer40   = 45,
	EEngramGroup__UnusedSpacer41   = 46,
	EEngramGroup__UnusedSpacer42   = 47,
	EEngramGroup__UnusedSpacer43   = 48,
	EEngramGroup__UnusedSpacer44   = 49,
	EEngramGroup__UnusedSpacer45   = 50,
	EEngramGroup__UnusedSpacer46   = 51,
	EEngramGroup__UnusedSpacer47   = 52,
	EEngramGroup__UnusedSpacer48   = 53,
	EEngramGroup__UnusedSpacer49   = 54,
	EEngramGroup__UnusedSpacer50   = 55,
	EEngramGroup__UnusedSpacer51   = 56,
	EEngramGroup__UnusedSpacer52   = 57,
	EEngramGroup__UnusedSpacer53   = 58,
	EEngramGroup__UnusedSpacer54   = 59,
	EEngramGroup__UnusedSpacer55   = 60,
	EEngramGroup__UnusedSpacer56   = 61,
	EEngramGroup__UnusedSpacer57   = 62,
	EEngramGroup__UnusedSpacer58   = 63,
	EEngramGroup__ARK_EXTINCTION   = 64,
	EEngramGroup__UnusedSpacer59   = 65,
	EEngramGroup__UnusedSpacer60   = 66,
	EEngramGroup__UnusedSpacer61   = 67,
	EEngramGroup__UnusedSpacer62   = 68,
	EEngramGroup__UnusedSpacer63   = 69,
	EEngramGroup__UnusedSpacer64   = 70,
	EEngramGroup__UnusedSpacer65   = 71,
	EEngramGroup__UnusedSpacer66   = 72,
	EEngramGroup__UnusedSpacer67   = 73,
	EEngramGroup__UnusedSpacer68   = 74,
	EEngramGroup__UnusedSpacer69   = 75,
	EEngramGroup__UnusedSpacer70   = 76,
	EEngramGroup__UnusedSpacer71   = 77,
	EEngramGroup__UnusedSpacer72   = 78,
	EEngramGroup__UnusedSpacer73   = 79,
	EEngramGroup__UnusedSpacer74   = 80,
	EEngramGroup__UnusedSpacer75   = 81,
	EEngramGroup__UnusedSpacer76   = 82,
	EEngramGroup__UnusedSpacer77   = 83,
	EEngramGroup__UnusedSpacer78   = 84,
	EEngramGroup__UnusedSpacer79   = 85,
	EEngramGroup__UnusedSpacer80   = 86,
	EEngramGroup__UnusedSpacer81   = 87,
	EEngramGroup__UnusedSpacer82   = 88,
	EEngramGroup__UnusedSpacer83   = 89,
	EEngramGroup__UnusedSpacer84   = 90,
	EEngramGroup__UnusedSpacer85   = 91,
	EEngramGroup__UnusedSpacer86   = 92,
	EEngramGroup__UnusedSpacer87   = 93,
	EEngramGroup__UnusedSpacer88   = 94,
	EEngramGroup__UnusedSpacer89   = 95,
	EEngramGroup__UnusedSpacer90   = 96,
	EEngramGroup__UnusedSpacer91   = 97,
	EEngramGroup__UnusedSpacer92   = 98,
	EEngramGroup__UnusedSpacer93   = 99,
	EEngramGroup__UnusedSpacer94   = 100,
	EEngramGroup__UnusedSpacer95   = 101,
	EEngramGroup__UnusedSpacer96   = 102,
	EEngramGroup__UnusedSpacer97   = 103,
	EEngramGroup__UnusedSpacer98   = 104,
	EEngramGroup__UnusedSpacer99   = 105,
	EEngramGroup__UnusedSpacer100  = 106,
	EEngramGroup__UnusedSpacer101  = 107,
	EEngramGroup__UnusedSpacer102  = 108,
	EEngramGroup__UnusedSpacer103  = 109,
	EEngramGroup__UnusedSpacer104  = 110,
	EEngramGroup__UnusedSpacer105  = 111,
	EEngramGroup__UnusedSpacer106  = 112,
	EEngramGroup__UnusedSpacer107  = 113,
	EEngramGroup__UnusedSpacer108  = 114,
	EEngramGroup__UnusedSpacer109  = 115,
	EEngramGroup__UnusedSpacer110  = 116,
	EEngramGroup__UnusedSpacer111  = 117,
	EEngramGroup__UnusedSpacer112  = 118,
	EEngramGroup__UnusedSpacer113  = 119,
	EEngramGroup__UnusedSpacer114  = 120,
	EEngramGroup__UnusedSpacer115  = 121,
	EEngramGroup__UnusedSpacer116  = 122,
	EEngramGroup__UnusedSpacer117  = 123,
	EEngramGroup__UnusedSpacer118  = 124,
	EEngramGroup__UnusedSpacer119  = 125,
	EEngramGroup__UnusedSpacer120  = 126,
	EEngramGroup__UnusedSpacer121  = 127,
	EEngramGroup__ARK_GENESIS      = 128,
	EEngramGroup__ARK_GEN2         = 129,
	EEngramGroup__MAX              = 130,
	EEngramGroup__EEngramGroup_MAX = 131,

};

// Enum ShooterGame.PrimalInventoryComponent.EPrimalItemMessage
enum class ShooterGame_EPrimalItemMessage : uint8_t
{
	EPrimalItemMessage__Broken     = 0,
	EPrimalItemMessage__Repaired   = 1,
	EPrimalItemMessage__MAX        = 2,
	EPrimalItemMessage__EPrimalItemMessage_MAX = 3,

};

// Enum ShooterGame.ShooterPlayerController.EPrimalStatsValueTypes
enum class ShooterGame_EPrimalStatsValueTypes : uint8_t
{
	EPrimalStatsValueTypes__TotalShots = 0,
	EPrimalStatsValueTypes__Misses = 1,
	EPrimalStatsValueTypes__HitsStructure = 2,
	EPrimalStatsValueTypes__HitsDinoBody = 3,
	EPrimalStatsValueTypes__HitsDinoCritical = 4,
	EPrimalStatsValueTypes__HitsPlayerBody = 5,
	EPrimalStatsValueTypes__HitsPlayerCritical = 6,
	EPrimalStatsValueTypes__MAX    = 7,
	EPrimalStatsValueTypes__EPrimalStatsValueTypes_MAX = 8,

};

// Enum ShooterGame.BiomeZoneVolume.EBiomeZone
enum class ShooterGame_EBiomeZone : uint8_t
{
	EBiomeZone__None               = 0,
	EBiomeZone__Beach              = 1,
	EBiomeZone__Canyon             = 2,
	EBiomeZone__River              = 3,
	EBiomeZone__Grassland          = 4,
	EBiomeZone__Swamp              = 5,
	EBiomeZone__Jungle             = 6,
	EBiomeZone__RedwoodForest      = 7,
	EBiomeZone__Mountain           = 8,
	EBiomeZone__Snow               = 9,
	EBiomeZone__Ocean              = 10,
	EBiomeZone__Lava               = 11,
	EBiomeZone__Surface            = 12,
	EBiomeZone__FertileChamber     = 13,
	EBiomeZone__BioluminescentChamber = 14,
	EBiomeZone__ElementChamber     = 15,
	EBiomeZone__Wasteland          = 16,
	EBiomeZone__EBiomeZone_MAX     = 17,

};

// Enum ShooterGame.TerrainGenerator.EVoronoiBlendType
enum class ShooterGame_EVoronoiBlendType : uint8_t
{
	EVoronoiBlendType__Flat        = 0,
	EVoronoiBlendType__Closest     = 1,
	EVoronoiBlendType__SecondClosest = 2,
	EVoronoiBlendType__Cellular    = 3,
	EVoronoiBlendType__Organic     = 4,
	EVoronoiBlendType__EVoronoiBlendType_MAX = 5,

};

// Enum ShooterGame.DataListEntryButton_PrimalFolder.FolderWidgetType
enum class ShooterGame_EFolderWidgetType : uint8_t
{
	FolderWidgetType__FWT_Back     = 0,
	FolderWidgetType__FWT_Folder   = 1,
	FolderWidgetType__FWT_CustomFolder = 2,
	FolderWidgetType__FWT_MAX      = 3,

};

// Enum ShooterGame.FlockingBehavior.EBoidType
enum class ShooterGame_EBoidType : uint8_t
{
	EBoidType__Follower            = 0,
	EBoidType__Leader              = 1,
	EBoidType__FreeAgent           = 2,
	EBoidType__EBoidType_MAX       = 3,

};

// Enum ShooterGame.MissionMetaTagInfo.ENativeMissionMetaTag
enum class ShooterGame_ENativeMissionMetaTag : uint8_t
{
	ENativeMissionMetaTag__INVALID = 0,
	ENativeMissionMetaTag__GENESIS_VR_BOSS_UNLOCK = 1,
	ENativeMissionMetaTag__ARCTIC_MISSION = 2,
	ENativeMissionMetaTag__BOG_MISSION = 3,
	ENativeMissionMetaTag__LUNAR_MISSION = 4,
	ENativeMissionMetaTag__OCEAN_MISSION = 5,
	ENativeMissionMetaTag__VOLCANIC_MISSION = 6,
	ENativeMissionMetaTag__NORMAL_DIFFICULTY = 7,
	ENativeMissionMetaTag__ALPHA_DIFFICULTY = 8,
	ENativeMissionMetaTag__BETA_DIFFICULTY = 9,
	ENativeMissionMetaTag__GAMMA_DIFFICULTY = 10,
	ENativeMissionMetaTag__MAX     = 11,
	ENativeMissionMetaTag__ENativeMissionMetaTag_MAX = 12,

};

// Enum ShooterGame.MissionDispatcher.EMissionDispatcherTriggerMode
enum class ShooterGame_EMissionDispatcherTriggerMode : uint8_t
{
	EMissionDispatcherTriggerMode__AutoStartMission = 0,
	EMissionDispatcherTriggerMode__Ignore = 1,
	EMissionDispatcherTriggerMode__ActivateViaMultiUse = 2,
	EMissionDispatcherTriggerMode__EMissionDispatcherTriggerMode_MAX = 3,

};

// Enum ShooterGame.MissionType.EMissionDispatchMode
enum class ShooterGame_EMissionDispatchMode : uint8_t
{
	EMissionDispatchMode__StartAnywhere = 0,
	EMissionDispatchMode__RequireNearbyMissionDispatcher = 1,
	EMissionDispatchMode__RequireInsideMissionDispatcher = 2,
	EMissionDispatchMode__UseBPStaticCanStartMission = 3,
	EMissionDispatchMode__RequireInsideDispatcherNoCheck = 4,
	EMissionDispatchMode__EMissionDispatchMode_MAX = 5,

};

// Enum ShooterGame.PrimalBuff_Companion.ECompanionState
enum class ShooterGame_ECompanionState : uint8_t
{
	ECompanionState__IDLE          = 0,
	ECompanionState__FOCUSED       = 1,
	ECompanionState__EVENT         = 2,
	ECompanionState__MONOLOGUE     = 3,
	ECompanionState__ASLEEP        = 4,
	ECompanionState__CUSTOM        = 5,
	ECompanionState__ECompanionState_MAX = 6,

};

// Enum ShooterGame.PrimalDinoCharacter.EBabyCuddleType
enum class ShooterGame_EBabyCuddleType : uint8_t
{
	EBabyCuddleType__PET           = 0,
	EBabyCuddleType__FOOD          = 1,
	EBabyCuddleType__WALK          = 2,
	EBabyCuddleType__MAX           = 3,
	EBabyCuddleType__EBabyCuddleType_MAX = 4,

};

// Enum ShooterGame.PrimalUI.ControlDirection
enum class ShooterGame_EControlDirection : uint8_t
{
	None                           = 0,
	Up                             = 1,
	Down                           = 2,
	Left                           = 3,
	Right                          = 4,
	ControlDirection_MAX           = 5,

};

// Enum ShooterGame.PrimalUI.HighlightStartingPoint
enum class ShooterGame_EHighlightStartingPoint : uint8_t
{
	TopLeft                        = 0,
	Center                         = 1,
	HighlightStartingPoint_MAX     = 2,

};

// Enum ShooterGame.PrimalClimbingSettings.EClimbingAnimationType
enum class ShooterGame_EClimbingAnimationType : uint8_t
{
	EClimbingAnimationType__Up     = 0,
	EClimbingAnimationType__Down   = 1,
	EClimbingAnimationType__Right  = 2,
	EClimbingAnimationType__Left   = 3,
	EClimbingAnimationType__MeleeUp = 4,
	EClimbingAnimationType__MeleeRight = 5,
	EClimbingAnimationType__MeleeLeft = 6,
	EClimbingAnimationType__FinishUp = 7,
	EClimbingAnimationType__FinishDown = 8,
	EClimbingAnimationType__HangingFwd = 9,
	EClimbingAnimationType__HangingMelee = 10,
	EClimbingAnimationType__HangingFinishUp = 11,
	EClimbingAnimationType__HangingFinishDown = 12,
	EClimbingAnimationType__JumpUp = 13,
	EClimbingAnimationType__JumpUpRight = 14,
	EClimbingAnimationType__JumpUpLeft = 15,
	EClimbingAnimationType__SlideDown = 16,
	EClimbingAnimationType__AttachUp = 17,
	EClimbingAnimationType__AttachDown = 18,
	EClimbingAnimationType__AttachHangingUp = 19,
	EClimbingAnimationType__AttachHangingDown = 20,
	EClimbingAnimationType__FlipLeft = 21,
	EClimbingAnimationType__FlipRight = 22,
	EClimbingAnimationType__FlipUp = 23,
	EClimbingAnimationType__FlipDown = 24,
	EClimbingAnimationType__TurnUp = 25,
	EClimbingAnimationType__TurnDown = 26,
	EClimbingAnimationType__TurnRight = 27,
	EClimbingAnimationType__TurnLeft = 28,
	EClimbingAnimationType__OpenInventory = 29,
	EClimbingAnimationType__OpenInventoryHanging = 30,
	EClimbingAnimationType__QuakeFall = 31,
	EClimbingAnimationType__MAX    = 32,
	EClimbingAnimationType__EClimbingAnimationType_MAX = 33,

};

// Enum ShooterGame.PrimalClimbingSettings.EClimbingType
enum class ShooterGame_EClimbingType : uint8_t
{
	EClimbingType__None            = 0,
	EClimbingType__ClimbLook       = 1,
	EClimbingType__ClimbInput      = 2,
	EClimbingType__Slide           = 3,
	EClimbingType__MAX             = 4,
	EClimbingType__EClimbingType_MAX = 5,

};

// Enum ShooterGame.PrimalClimbingSettings.EClimbingMode
enum class ShooterGame_EClimbingMode : uint8_t
{
	EClimbingMode__None            = 0,
	EClimbingMode__Attached        = 1,
	EClimbingMode__Finalizing      = 2,
	EClimbingMode__MAX             = 3,
	EClimbingMode__EClimbingMode_MAX = 4,

};

// Enum ShooterGame.PrimalBuff_Grappled.EGrappleState
enum class ShooterGame_EGrappleState : uint8_t
{
	EGrappleState__GRAPPLE_Idle    = 0,
	EGrappleState__GRAPPLE_Pulling = 1,
	EGrappleState__GRAPPLE_Releasing = 2,
	EGrappleState__GRAPPLE_Custom  = 3,
	EGrappleState__GRAPPLE_Max     = 4,

};

// Enum ShooterGame.PrimalStructureElevatorPlatform.EPrimalStructureElevatorState
enum class ShooterGame_EPrimalStructureElevatorState : uint8_t
{
	PSLS_Down                      = 0,
	PSLS_Up                        = 1,
	PSLS_MAX                       = 2,

};

// Enum ShooterGame.PrimalWorldBuffData.EWorldBuffDifficultyType
enum class ShooterGame_EWorldBuffDifficultyType : uint8_t
{
	EWorldBuffDifficultyType__GAMMA = 0,
	EWorldBuffDifficultyType__BETA = 1,
	EWorldBuffDifficultyType__ALPHA = 2,
	EWorldBuffDifficultyType__OTHER = 3,
	EWorldBuffDifficultyType__EWorldBuffDifficultyType_MAX = 4,

};

// Enum ShooterGame.PrimalWorldBuffData.EWorldBuffPropertyLocation
enum class ShooterGame_EWorldBuffPropertyLocation : uint8_t
{
	EWorldBuffPropertyLocation__GameMode = 0,
	EWorldBuffPropertyLocation__GameState = 1,
	EWorldBuffPropertyLocation__EWorldBuffPropertyLocation_MAX = 2,

};

// Enum ShooterGame.VictoryCore.EEditorMessageLogLevel
enum class ShooterGame_EEditorMessageLogLevel : uint8_t
{
	EEditorMessageLogLevel__Error  = 0,
	EEditorMessageLogLevel__Warning = 1,
	EEditorMessageLogLevel__Info   = 2,
	EEditorMessageLogLevel__Success = 3,
	EEditorMessageLogLevel__EEditorMessageLogLevel_MAX = 4,

};

// Enum ShooterGame.VictoryCore.EServerOctreeGroup
enum class ShooterGame_EServerOctreeGroup : uint8_t
{
	EServerOctreeGroup__STASISCOMPONENTS = 0,
	EServerOctreeGroup__PLAYERPAWNS = 1,
	EServerOctreeGroup__DINOPAWNS  = 2,
	EServerOctreeGroup__PAWNS      = 3,
	EServerOctreeGroup__STRUCTURES = 4,
	EServerOctreeGroup__TARGETABLEACTORS = 5,
	EServerOctreeGroup__PLAYERS_CONNECTED = 6,
	EServerOctreeGroup__SPATIALNETWORKEDACTORS = 7,
	EServerOctreeGroup__SPATIALNETWORKEDACTORS_DORMANT = 8,
	EServerOctreeGroup__ALL_SPATIAL = 9,
	EServerOctreeGroup__THERMALSTRUCTURES = 10,
	EServerOctreeGroup__STRUCTURES_CORE = 11,
	EServerOctreeGroup__DINOPAWNS_TAMED = 12,
	EServerOctreeGroup__PLAYERS_AND_TAMED_DINOS = 13,
	EServerOctreeGroup__PLAYERS_CONNECTED_AND_TAMED_DINOS = 14,
	EServerOctreeGroup__DINOFOODCONTAINER = 15,
	EServerOctreeGroup__GRENADES   = 16,
	EServerOctreeGroup__TREESAPTAPS = 17,
	EServerOctreeGroup__LARGEUNSTASISRANGE = 18,
	EServerOctreeGroup__TRAPS      = 19,
	EServerOctreeGroup__MAX        = 20,
	EServerOctreeGroup__EServerOctreeGroup_MAX = 21,

};

// Enum ShooterGame.PrimalProjectileNetGun.ETraceType
enum class ShooterGame_ETraceType : uint8_t
{
	ETraceType__TT_LineTrace       = 0,
	ETraceType__TT_ArcTrace        = 1,
	ETraceType__TT_Max             = 2,

};

// Enum ShooterGame.StructuresPlus.EGlassTransparencyType
enum class ShooterGame_EGlassTransparencyType : uint8_t
{
	EGlassTransparencyType__TwoWay = 0,
	EGlassTransparencyType__OneWayA = 1,
	EGlassTransparencyType__OneWayB = 2,
	EGlassTransparencyType__Opaque = 3,
	EGlassTransparencyType__EGlassTransparencyType_MAX = 4,

};

// Enum ShooterGame.StructuresPlus.ESPMessageType
enum class ShooterGame_ESPMessageType : uint8_t
{
	ESPMessageType__Default        = 0,
	ESPMessageType__Error          = 1,
	ESPMessageType__Warning        = 2,
	ESPMessageType__Helpful        = 3,
	ESPMessageType__ESPMessageType_MAX = 4,

};

// Enum ShooterGame.WaterVolumeWithFlow.EColorChannelTarget
enum class ShooterGame_EColorChannelTarget : uint8_t
{
	EColorChannelTarget__Red       = 0,
	EColorChannelTarget__Green     = 1,
	EColorChannelTarget__Blue      = 2,
	EColorChannelTarget__Alpha     = 3,
	EColorChannelTarget__All       = 4,
	EColorChannelTarget__EColorChannelTarget_MAX = 5,

};

// Enum ShooterGame.ContextMenuItem.UContextMenuItemSwitchMode
enum class ShooterGame_EUContextMenuItemSwitchMode : uint8_t
{
	UContextMenuItemSwitchMode__None = 0,
	UContextMenuItemSwitchMode__Radio = 1,
	UContextMenuItemSwitchMode__Checkbox = 2,
	UContextMenuItemSwitchMode__UContextMenuItemSwitchMode_MAX = 3,

};

// Enum ShooterGame.PrimalStructurePlacer.EPrimalStructurePlacerState
enum class ShooterGame_EPrimalStructurePlacerState : uint8_t
{
	EPrimalStructurePlacerState__Default = 0,
	EPrimalStructurePlacerState__FadeAway = 1,
	EPrimalStructurePlacerState__PlacingStructure = 2,
	EPrimalStructurePlacerState__EPrimalStructurePlacerState_MAX = 3,

};

// Enum ShooterGame.PrimalStructureItemContainer_CropPlot.ESeedCropPhase
enum class ShooterGame_ESeedCropPhase : uint8_t
{
	ESeedCropPhase__Seedling       = 0,
	ESeedCropPhase__Midling        = 1,
	ESeedCropPhase__Growthling     = 2,
	ESeedCropPhase__Fruiting       = 3,
	ESeedCropPhase__MAX            = 4,
	ESeedCropPhase__ESeedCropPhase_MAX = 5,

};

// Enum ShooterGame.UI_Inventory.EDropItemIconAction
enum class ShooterGame_EDropItemIconAction : uint8_t
{
	EDropItemIconAction__DA_NoAction = 0,
	EDropItemIconAction__DA_Equip  = 1,
	EDropItemIconAction__DA_UnEquip = 2,
	EDropItemIconAction__DA_AddToSlot = 3,
	EDropItemIconAction__DA_RemoveFromSlot = 4,
	EDropItemIconAction__DA_ToRemoteInv = 5,
	EDropItemIconAction__DA_FromRemoteInv = 6,
	EDropItemIconAction__DA_RemoteEquip = 7,
	EDropItemIconAction__DA_MergeItemStack = 8,
	EDropItemIconAction__DA_SplitItemStack = 9,
	EDropItemIconAction__DA_SwapItems = 10,
	EDropItemIconAction__DA_UseWithItem = 11,
	EDropItemIconAction__DA_UnEquipTransferToLocal = 12,
	EDropItemIconAction__DA_RemoveItemSkin = 13,
	EDropItemIconAction__DA_SplitItemStackOne = 14,
	EDropItemIconAction__DA_RemoveWeaponAmmo = 15,
	EDropItemIconAction__DA_FromRemoteInvToSlot = 16,
	EDropItemIconAction__DA_ToRemoteInvFromSlot = 17,
	EDropItemIconAction__DA_EquipLocalFromRemote = 18,
	EDropItemIconAction__DA_EquipRemoteFromLocal = 19,
	EDropItemIconAction__DA_UnequipRemote = 20,
	EDropItemIconAction__DA_UnequipTransferToRemote = 21,
	EDropItemIconAction__DA_ToArkInv = 22,
	EDropItemIconAction__DA_FromArkInv = 23,
	EDropItemIconAction__MAX       = 24,
	EDropItemIconAction__EDropItemIconAction_MAX = 25,

};

// Enum ShooterGame.UI_MissionList.EDataDisplay
enum class ShooterGame_EDataDisplay : uint8_t
{
	EDataDisplay__MISSION_INFO     = 0,
	EDataDisplay__LEADERBOARDS     = 1,
	EDataDisplay__EDataDisplay_MAX = 2,

};

// Enum ShooterGame.UI_MissionList.EListDisplay
enum class ShooterGame_EListDisplay : uint8_t
{
	EListDisplay__MISSIONS         = 0,
	EListDisplay__EFFECTS          = 1,
	EListDisplay__EListDisplay_MAX = 2,

};

// Enum ShooterGame.UI_Hub.EHubSubMenu
enum class ShooterGame_EHubSubMenu : uint8_t
{
	EHubSubMenu__Inventory         = 0,
	EHubSubMenu__Engrams           = 1,
	EHubSubMenu__TribeManager      = 2,
	EHubSubMenu__TameGroups        = 3,
	EHubSubMenu__TamingList        = 4,
	EHubSubMenu__SurvivalProfile   = 5,
	EHubSubMenu__MissionList       = 6,
	EHubSubMenu__MAX               = 7,
	EHubSubMenu__EHubSubMenu_MAX   = 8,

};

//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct ShooterGame.PrimalGameData.PrimalCharacterStatusValueDefinition
// 0x0020
struct FPrimalCharacterStatusValueDefinition
{
	class UTexture2D*                                  StatusValueIcon;                                           // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FString                                     StatusValueName;                                           // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               bLevelUpSetToMaxValue;                                     // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bDisplayHideCurrentValue;                                  // 0x0019(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bDisplayAsPercent;                                         // 0x001A(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_WK90[0x5];                                     // 0x001B(0x0005) MISSED OFFSET (PADDING)

};

// ScriptStruct ShooterGame.PrimalGameData.PrimalItemStatDefinition
// 0x0018
struct FPrimalItemStatDefinition
{
	class UTexture2D*                                  ItemStatIcon;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FString                                     ItemStatName;                                              // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

};

// ScriptStruct ShooterGame.PrimalGameData.PrimalItemDefinition
// 0x0018
struct FPrimalItemDefinition
{
	class UTexture2D*                                  ItemTypeIcon;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FString                                     ItemTypeName;                                              // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

};

// ScriptStruct ShooterGame.PrimalGameData.PrimalEquipmentDefinition
// 0x0018
struct FPrimalEquipmentDefinition
{
	class UTexture2D*                                  EquipmentTypeIcon;                                         // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FString                                     EquipmentTypeName;                                         // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

};

// ScriptStruct ShooterGame.PrimalGameData.AppIDItem
// 0x0060
struct FAppIDItem
{
	struct FString                                     AchievementID;                                             // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<struct FString>                             AchievementIDs;                                            // 0x0010(0x0010) (Edit, ZeroConstructor)
	struct FName                                       GiveItemIfEmoteNameUnlocked;                               // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	int                                                AppID;                                                     // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	int                                                PlayerBadgeGroup;                                          // 0x002C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               bForceNewDefaultCosmetic;                                  // 0x0030(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_P87G[0x7];                                     // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FString>                             PlayerIDStrings;                                           // 0x0038(0x0010) (Edit, ZeroConstructor)
	class UClass*                                      ItemClass;                                                 // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UClass*>                              ItemClasses;                                               // 0x0050(0x0010) (Edit, ZeroConstructor)

};

// ScriptStruct ShooterGame.RangedValues
// 0x0008
struct FRangedValues
{
	int                                                Range;                                                     // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	int                                                Value;                                                     // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)

};

// ScriptStruct ShooterGame.PrimalGameData.LevelExperienceRamp
// 0x0010
struct FLevelExperienceRamp
{
	TArray<float>                                      ExperiencePointsForLevel;                                  // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

};

// ScriptStruct ShooterGame.PrimalGameData.NamedTeamDefinition
// 0x0080
struct FNamedTeamDefinition
{
	struct FName                                       TeamName;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      bTargetingTeamExclusionList : 1;                           // 0x0008(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor)
	unsigned char                                      bTargetingTeamInclusionList : 1;                           // 0x0008(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor)
	unsigned char                                      bAllowTargetsOnOwnTeam : 1;                                // 0x0008(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor)
	unsigned char                                      bIsCarnivore : 1;                                          // 0x0008(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor)
	unsigned char                                      bTargetPlayersAndTamedOnly : 1;                            // 0x0008(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor)
	unsigned char                                      bForceTargetPlayersAndTamed : 1;                           // 0x0008(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor)
	unsigned char                                      bIgnoredByAllTeams : 1;                                    // 0x0008(0x0001) BIT_FIELD (Edit, DisableEditOnInstance, NoDestructor)
	unsigned char                                      UnknownData_LFLC[0x7];                                     // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FName>                               TeamNameList;                                              // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               TargetingMultiplierTeamNames;                              // 0x0020(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               DontGiveDamageTeamList;                                    // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               DontReceiveDamageTeamList;                                 // 0x0040(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               MaximumTargetableDistanceTeams;                            // 0x0050(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      MaximumTargetableDistances;                                // 0x0060(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      TargetingMultiplierTeamWeights;                            // 0x0070(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

};

// ScriptStruct ShooterGame.PrimalGameData.ExplorerNoteAchievement
// 0x0020
struct FExplorerNoteAchievement
{
	struct FString                                     AchievementName;                                           // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<int>                                        ExplorerNoteIndices;                                       // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

};

// ScriptStruct ShooterGame.PrimalGameData.ClassRemapping
// 0x0010
struct FClassRemapping
{
	class UClass*                                      FromClass;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UClass*                                      ToClass;                                                   // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)

};

// ScriptStruct ShooterGame.PrimalGameData.ActiveEventSupplyCrateWeight
// 0x0028
struct FActiveEventSupplyCrateWeight
{
	TArray<class UClass*>                              ReplacementCrateClasses;                                   // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<float>                                      Weights;                                                   // 0x0010(0x0010) (Edit, ZeroConstructor)
	struct FName                                       ActiveEvent;                                               // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)

};

// ScriptStruct ShooterGame.PrimalGameData.ClassAddition
// 0x0018
struct FClassAddition
{
	class UClass*                                      ForClass;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UClass*>                              ClassAdditions;                                            // 0x0008(0x0010) (Edit, ZeroConstructor)

};

// ScriptStruct ShooterGame.PrimalGameData.BuffAddition
// 0x0018
struct FBuffAddition
{
	class UClass*                                      ForClass;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UClass*>                              BuffAdditions;                                             // 0x0008(0x0010) (Edit, ZeroConstructor)

};

// ScriptStruct ShooterGame.AvailableMission
// 0x0018
struct FAvailableMission
{
	class UClass*                                      MissionClass;                                              // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_FN6M[0x10];                                    // 0x0008(0x0010) MISSED OFFSET (PADDING)

};

// ScriptStruct ShooterGame.PrimalGameData.RandValueRange
// 0x000C
struct FRandValueRange
{
	float                                              MinVal;                                                    // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              MaxVal;                                                    // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              RandPower;                                                 // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

};

// ScriptStruct ShooterGame.PrimalGameData.MultiAchievement
// 0x0020
struct FMultiAchievement
{
	struct FString                                     UnlockAchievement;                                         // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FString>                             RequiredAchievements;                                      // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

};

// ScriptStruct ShooterGame.PrimalGameData.ClassRemappingWeight
// 0x0038
struct FClassRemappingWeight
{
	class UClass*                                      FromClass;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UClass*>                              ToClasses;                                                 // 0x0008(0x0010) (Edit, ZeroConstructor)
	TArray<float>                                      Weights;                                                   // 0x0018(0x0010) (Edit, ZeroConstructor)
	struct FName                                       ActiveEvent;                                               // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	unsigned char                                      bExactMatch : 1;                                           // 0x0030(0x0001) BIT_FIELD (Edit, NoDestructor)
	unsigned char                                      UnknownData_5XDP[0x7];                                     // 0x0031(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct ShooterGame.PrimalGameData.NPCDifficultyLevelRange
// 0x0030
struct FNPCDifficultyLevelRange
{
	TArray<float>                                      EnemyLevelsMin;                                            // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	TArray<float>                                      EnemyLevelsMax;                                            // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	TArray<float>                                      GameDifficulties;                                          // 0x0020(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)

};

// ScriptStruct ShooterGame.PrimalGameData.NPCSpawnLimit
// 0x0020
struct FNPCSpawnLimit
{
	class UClass*                                      NPCClass;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FString                                     NPCClassString;                                            // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              MaxPercentageOfDesiredNumToAllow;                          // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_KRRB[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct ShooterGame.PrimalGameData.UnlockableEmoteEntry
// 0x0048
struct FUnlockableEmoteEntry
{
	struct FName                                       EmoteName;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FString                                     EmoteDescription;                                          // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FName                                       EmoteGroup;                                                // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FString                                     UseEmoteMessage;                                           // 0x0020(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UAnimMontage*                                MaleAnim;                                                  // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimMontage*                                FemaleAnim;                                                // 0x0038(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              EmotePlayMinimumInterval;                                  // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bGiveDefault;                                              // 0x0044(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_8ULD[0x3];                                     // 0x0045(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct ShooterGame.PrimalGameData.ObjectCorrelation
// 0x0010
struct FObjectCorrelation
{
	class UObject*                                     FromObject;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                     ToObject;                                                  // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor)

};

// ScriptStruct ShooterGame.PrimalGameData.OverrideAnimBlueprintEntry
// 0x0010
struct FOverrideAnimBlueprintEntry
{
	class UClass*                                      FromBPClass;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                      ToBPClass;                                                 // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

};

// ScriptStruct ShooterGame.PrimalGameData.HairStyleDefinition
// 0x0040
struct FHairStyleDefinition
{
	bool                                               bIsHairStyleLocked;                                        // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_XUL8[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       UnlockHairStyleName;                                       // 0x0004(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_O11D[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     HairStyleName;                                             // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class USkeletalMesh*                               HairMeshMale;                                              // 0x0020(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
